maze = [ [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9],
         [9, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 9],
         [9, 0, 9, 0, 0, 0, 9, 9, 0, 9, 9, 9],
         [9, 0, 9, 9, 0, 9, 0, 0, 0, 9, 0, 9],
         [9, 0, 0, 0, 9, 0, 0, 9, 9, 0, 9, 9], 
         [9, 9, 9, 0, 0, 9, 0, 9, 0, 0, 0, 9], 
         [9, 0, 0, 0, 9, 0, 9, 0, 0, 9, 1, 9], 
         [9, 0, 9, 0, 0, 0, 0, 9, 0, 0, 9, 9], 
         [9, 0, 0, 9, 0, 9, 0, 0, 9, 0, 0, 9], 
         [9, 0, 9, 0, 9, 0, 9, 0, 0, 9, 0, 9], 
         [9, 0, 0, 0, 0, 0, 0, 9, 0, 0, 0, 9], 
         [9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9] ]


# スタート 位置( x 座標、 y 座標、 移動 回数) を セット
pos = [[1 , 1 , 0]]

while len(pos) > 0:
    x, y, depth = pos.pop(0)

    if maze[x][y] == 1:
        print(depth)
        break

    # 探索済み 
    maze[x][y] = 2
    
    #上下 左右 を 探索 
    if maze[ x - 1][ y] < 2: 
        pos.append([ x - 1, y, depth + 1])
    
    if maze[ x + 1][ y] < 2:
        pos.append([ x + 1, y, depth + 1])
    
    if maze[ x][ y - 1] < 2: 
        pos.append([ x, y - 1, depth + 1])
        
    if maze[ x][ y + 1] < 2: 
        pos.append([ x, y + 1, depth + 1])

    print("search:"+ str(depth))

    for row in maze:
        print(row)

    print(pos)
    print("---------")